Function Reference

# Textures
| | | |
|---|---|---|
| AddCustomTexPart | ApplyCustomTexPart | AttachDefaultTextureSpace <sub>*obsolete in Vectorworks 2009*</sub>|
| CreatePaintFromImage | CreatePaintFromImgN | CreateShaderRecord |
| CreateTexture | CreateTextureBitmap <sub>*obsolete in VectorWorks10.1*</sub>| CreateTextureBitmapD |
| CreateTextureBitmapN | CustomTexPartExists | DeleteTextureSpace <sub>*obsolete in Vectorworks 2009*</sub>|
| EditShaderRecord | EditTexture | EditTextureBitmap <sub>*obsolete in VectorWorks9.0*</sub>|
| EditTextureSpace <sub>*obsolete in Vectorworks 2009*</sub>| GetClTextureC | GetClTextureD |
| GetClTextureG | GetClTextureL | GetClTextureR |
| GetClTextureT | GetClUseTexture | GetImageCropObject |
| GetNumTexLayers | GetObjExpandTexture <sub>*obsolete in Vectorworks 2009*</sub>| GetShaderRecord |
| GetTexBFeatureEnd | GetTexBFeatureStart | GetTexBitFeatureSize |
| GetTexBitmapOrigin <sub>*obsolete in VectorWorks9.0*</sub>| GetTexBitPaintNode <sub>*obsolete in VectorWorks12.0*</sub>| GetTexBitRepHoriz |
| GetTexBitRepVert | GetTexMapBool <sub>*obsolete in Vectorworks 2010*</sub>| GetTexMapBoolN |
| GetTexMapInt <sub>*obsolete in Vectorworks 2010*</sub>| GetTexMapIntN | GetTexMapReal <sub>*obsolete in Vectorworks 2010*</sub>|
| GetTexMapRealN | GetTexSpace2DOffset <sub>*obsolete in Vectorworks 2009*</sub>| GetTexSpace2DRadius <sub>*obsolete in Vectorworks 2009*</sub>|
| GetTexSpace2DRot <sub>*obsolete in Vectorworks 2009*</sub>| GetTexSpace2DScale <sub>*obsolete in Vectorworks 2009*</sub>| GetTexSpaceEndCap <sub>*obsolete in Vectorworks 2009*</sub>|
| GetTexSpaceKind <sub>*obsolete in Vectorworks 2009*</sub>| GetTexSpaceOrientU <sub>*obsolete in Vectorworks 2009*</sub>| GetTexSpaceOrientV <sub>*obsolete in Vectorworks 2009*</sub>|
| GetTexSpaceOrientW <sub>*obsolete in Vectorworks 2009*</sub>| GetTexSpaceOrigin <sub>*obsolete in Vectorworks 2009*</sub>| GetTexSpacePartID <sub>*obsolete in Vectorworks 2009*</sub>|
| GetTexSpaceStartCap <sub>*obsolete in Vectorworks 2009*</sub>| GetTextureBitmap | GetTextureRef <sub>*obsolete in Vectorworks 2010*</sub>|
| GetTextureRefN | GetTextureSet | GetTextureShader <sub>*obsolete in VectorWorks9.0*</sub>|
| GetTextureShininess <sub>*obsolete in VectorWorks9.0*</sub>| GetTextureSize | GetTextureSpace <sub>*obsolete in Vectorworks 2009*</sub>|
| GetTextureTransp <sub>*obsolete in VectorWorks9.0*</sub>| GetWallHoleTexturePart | GS_EdSh_ConstructLayout |
| GS_EdSh_PopulateMenu | GS_EdSh_RunDialog | IsImageCropped |
| IsImageCropVisible | IsRW | IsTextureableObject |
| RemoveCustomTexParts | ResolveByClassTextureRef | SetClTextureC |
| SetClTextureD | SetClTextureG | SetClTextureL |
| SetClTextureR | SetClTextureT | SetCustomRWPrefs |
| SetDefaultTexMap <sub>*obsolete in Vectorworks 2010*</sub>| SetDefaultTexMapN | SetDefaultTextureSpace <sub>*obsolete in Vectorworks 2009*</sub>|
| SetImageCropObject | SetImageCropVisible | SetObjExpandTexture <sub>*obsolete in Vectorworks 2009*</sub>|
| SetOpenGLPrefs | SetTexBFeatureEnd | SetTexBFeatureStart |
| SetTexBitFeatureSize | SetTexBitmapOrigin <sub>*obsolete in VectorWorks9.0*</sub>| SetTexBitPaintNode <sub>*obsolete in VectorWorks12.0*</sub>|
| SetTexBitRepHoriz | SetTexBitRepVert | SetTexMapBool <sub>*obsolete in Vectorworks 2010*</sub>|
| SetTexMapBoolN | SetTexMapInt <sub>*obsolete in Vectorworks 2010*</sub>| SetTexMapIntN |
| SetTexMapReal <sub>*obsolete in Vectorworks 2010*</sub>| SetTexMapRealN | SetTexSpace2DOffset <sub>*obsolete in Vectorworks 2009*</sub>|
| SetTexSpace2DRadius <sub>*obsolete in Vectorworks 2009*</sub>| SetTexSpace2DRot <sub>*obsolete in Vectorworks 2009*</sub>| SetTexSpace2DScale <sub>*obsolete in Vectorworks 2009*</sub>|
| SetTexSpaceEndCap <sub>*obsolete in Vectorworks 2009*</sub>| SetTexSpaceKind <sub>*obsolete in Vectorworks 2009*</sub>| SetTexSpaceOrientU <sub>*obsolete in Vectorworks 2009*</sub>|
| SetTexSpaceOrientV <sub>*obsolete in Vectorworks 2009*</sub>| SetTexSpaceOrientW <sub>*obsolete in Vectorworks 2009*</sub>| SetTexSpaceOrigin <sub>*obsolete in Vectorworks 2009*</sub>|
| SetTexSpacePartID <sub>*obsolete in Vectorworks 2009*</sub>| SetTexSpaceStartCap <sub>*obsolete in Vectorworks 2009*</sub>| SetTextureBitmap |
| SetTextureRef <sub>*obsolete in Vectorworks 2010*</sub>| SetTextureRefN | SetTextureSet |
| SetTextureShader <sub>*obsolete in VectorWorks9.0*</sub>| SetTextureShininess <sub>*obsolete in VectorWorks9.0*</sub>| SetTextureSize |
| SetTextureTransp <sub>*obsolete in VectorWorks9.0*</sub>| SetWallHoleTexturePart